<html>
<head>
  <title>yWorks GmbH - Allgemeine Lizenzbedingungen</title>
  <link rel="stylesheet" type="text/css" href="doc/yfiles.css"/>
</head>
<body>

<h1>yWorks GmbH - Allgemeine Lizenzbedingungen</h1>

<center>Version 2.3 (18.01.2005)</center>

<h2>Inhalt</h2>

<h3><a href="#PartA">1. Teil A: Definitionen</a></h3>
<ol start="1" type="I">
  <li><a href="#Licensee">Lizenznehmer</a></li>
  <li><a href="#Licensor">Lizenzgeber</a></li>
  <li><a href="#Site">Unternehmensstandort</a> </li>
  <li><a href="#Software">Software</a> </li>
  <li><a href="#Documentation">Dokumentation</a> </li>
  <li><a href="#JavaSourceCode">Java Source Code</a> </li>
  <li><a href="#JavaByteCode">Java Byte Code</a> </li>
  <li><a href="#JavaProgram">Java Programm</a> </li>
  <li><a href="#Obfuscator">Java Name Obfuscation</a> </li>
  <li><a href="#VersionAndUpgrades">Version und Upgrades</a> </li>
</ol>

<h3><a href="#PartB">2. Teil B - yFiles Lizenzen</a></h3>
<ol start="1" type="I">
  <li><a href="#yFilesSourceCodeLicense">Source Code Lizenz</a></li>
  <li><a href="#yFilesByteCodeLicense">Byte Code Lizenz</a>
    <ol start="1" type="1">
      <li><a href="#yFilesSiteLicense">Standortlizenz</a></li>
      <li><a href="#yFilesServerLicense">Serverlizenz</a></li>
      <li><a href="#yFilesSingleUserLicense">Einzelplatzlizenz</a></li>
      <li><a href="#yFilesEvaluationLicense">Evaluierungslizenz</a></li>
    </ol>
  </li>
  <li><a href="#yFilesAcademicLicense">Akademische Lizenz</a></li>
</ol>

<h3><a href="#PartC">3. Teil C - Schlussbestimmungen</a></h3>
<ol start="1" type="I">
  <li><a href="#Deliverables">Auslieferung</a></li>
  <li><a href="#Prices">Preise</a></li>
  <li><a href="#IntellectualProperty">Geistiges Eigentum</a></li>
</ol>

<a name="PartA"></a>

<center><h1>- 1. Teil A -</h1></center>

<h2>Definitionen</h2>
<ol start="1" type="I">
  <li><a name="Licensee"></a><b>Lizenznehmer</b>
    <p> Lizenznehmer ("LZ") ist eine Person, Firma oder Institution, die Software
      der yWorks lizenziert, und der eine bestimmte Gesch&auml;fts- oder Privatadresse
      zugeordnet werden kann.
    </p><p> <a name="Licensor"></a> </p>
  </li>
  <li><b>Lizenzgeber</b>
    <p> Lizenzgeber ist die yWorks GmbH (&quot;yWorks&quot;), eine deutsche Firma
      mit Gesch&auml;ftssitz in T&uuml;bingen.
    </p><p> <a name="Site"></a> </p>
  </li>
  <li><b>Unternehmensstandort</b>
    <p> Der Unternehmensstandort bezeichnet einen spezifischen Wohn- bzw. Firmensitz des
        Lizenznehmers, der einer bestimmten Privat- bzw. Gesch&auml;ftsadresse
        zugeordnet werden kann.
    </p><p> <a name="Software"></a> </p>
  </li>
  <li><b>Software</b>
    <p> Software meint im zweiten Teil B: yFiles.
      yFiles ist eine Java Klassenbibliothek, die dem Betrachten, Editieren, Gestalten
      und Animieren graphen&auml;hnlicher Strukturen dient. Die Bibliothek ist vollst&auml;ndig
      in Java geschrieben.
    </p><p> <a name="Documentation"></a> </p>
  </li>
  <li><b>Dokumentation</b>
    <p> Dokumentation ist eine manuelle on-line Hilfe, oder ein Tutorial, das
      dem User hilft, die Software einzusetzen und zu benutzen.
    </p><p> <a name="JavaSourceCode"></a> </p>
  </li>
  <li><b>Java Source Code</b>
    <p> Java Source Code ist der vom Mensch geschriebene und/oder tool-generierte
      Quellcode, der als Eingabe f&uuml;r den Java Compiler genutzt wird, um den
      Java Byte Code zu produzieren.
    </p>
    <p> <a name="JavaByteCode"></a> </p>
  </li>
  <li><b>Java Byte Code</b>
    <p> Java Byte Code ist der Objektcode, der vom Java Compiler aus dem Source
      Code produziert wird. Java Byte Code ist damit der Objektcode, der von einer
      Java Virtual Machine (JVM) interpretiert (ausgef&uuml;hrt) werden kann.
    </p>
    <p> <a name="JavaProgram"></a> </p>
  </li>
  <li><b>Java Programm</b>
    <p> Java Programm ist ein ausf&uuml;hrbares St&uuml;ck Java Byte Code, das
      die Software ganz oder teilweise nutzen kann.
    </p><p> <a name="Obfuscator"></a> </p>
  </li>
  <li><b>Java Name Obfuscation</b>
    <p> Java Name Obfuscation ver&auml;ndert die Namen von Klassen, Feldern und
      Methoden auf konsistente, nicht verst&auml;ndliche Art, ohne hierbei die
      Funktionalit&auml;t der Software zu beeintr&auml;chtigen. Die Obfuskation
      erschwert die Lesbarkeit des dekompilierten Java Codes und verhindert die
      Anwendbarkeit der &ouml;ffentlich zug&auml;nglichen API des originalen (nicht obfuskierten)
      Codes auf den obfuskierten Code.
    </p><p> <a name="VersionAndUpgrades"></a> </p>
  </li>
  <li><b>Version und Upgrades</b>
    <p> Eine Versionsnummer besteht aus zwei oder mehr Ziffern. Zwei Ziffern stehen
      f&uuml;r eine neue Version, drei oder mehr Ziffern f&uuml;r ein Bug Fix Release. Bug
      Fix Releases beziehen sich auf diejenige Software Version, die in den f&uuml;hrenden
      zwei Ziffern der Versionsnummer mit ihr &uuml;bereinstimmt. Eine Software
      Lizenz gilt f&uuml;r jeweils eine Version und die zugeh&ouml;renden Bug
      Fix Releases. Um eine neue Version zu erhalten, m&uuml;ssen Lizenznehmer
      das Upgrade der Software lizenzieren. Im Rahmen eines Support- oder Subskriptionsvertrages
      (jeweils Link) werden Upgrades kostenfrei zur Verf&uuml;gung gestellt.
    </p>
  </li>
</ol>

<a name="PartB"></a>

<center><h1>- 2. Teil B -</h1></center>

<h2>yFiles Lizenzen</h2>
<ol start="1" type="I">
  <li>  <a name="yFilesSourceCodeLicense"></a> <b>Source Code Lizenz</b>
    <p> Eine Source Code Lizenz r&auml;umt LZ das Recht ein, yFiles als Java Source
      Code zu benutzen.
    </p>
    <p> Eine Source Code Lizenz berechtigt LZ, Programme zu entwickeln, die yFiles
      benutzen. Sie erlaubt ferner, solche Programme zu benutzen, zu &uuml;bersetzen,
      zu modifizieren, abgeleitete Werke zu kreieren, und sie zu verkaufen. Es
      fallen f&uuml;r Nutzer dieser Programme keine Geb&uuml;hren an, und der
      Verkauf solcher Programme erzeugt keine Tantiemeverpflichtung.
    </p>
    <p> Die Source Code Lizenz berechtigt LZ, die Software auf beliebig vielen
      Maschinen innerhalb des Unternehmensstandortes zu installieren und zu nutzen.
      LZ ist nicht berechtigt, Dritten die Software ganz oder teilweise zu verkaufen,
      zu verleihen, zu vermieten, oder die Software auf andere Weise zu belasten
      oder zu &uuml;bertragen. Insbesondere ist LZ nicht berechtigt, die Software
      &uuml;ber den Teil des Codes hinaus, der Bestandteil des Programms ist,
      ganz oder teilweise zu vertreiben.
    </p>
    <p> LZ ist nicht berechtigt, die Software in einer Art und Weise zu umh&uuml;llen
      (&quot;wrapping&quot;), die es Dritten erm&ouml;glicht, die Funktionalit&auml;t
      der yFiles f&uuml;r Softwareentwicklung zu nutzen.
    </p>
    <p>LZ ist nur dann zur Auslieferung von yFiles innerhalb eigener Programm(teile)
      berechtigt, wenn die yFiles Klassen zuvor durch Anwendung eines Java Obfuskators
      gesch&uuml;tzt werden. Mindestanforderung an den Obfuskationsproze&szlig;
      ist, dass alle wesentlichen Klassen-, Methoden- und Feldnamen der zu
      yFiles geh&ouml;renden Klassen obfuskiert werden. Es soll damit nicht mehr
      m&ouml;glich sein, mit Hilfe der &ouml;ffentlich verf&uuml;gbaren yFiles
      API die Funktionalit&auml;t<br/>
      der yFiles zu nutzen.
    </p>
    <p>Die Obfuskation der yFiles kann mit jedem Obfuskator ausgef&uuml;hrt werden,
      der oben genannte Mindestanforderungen erf&uuml;llt. yWorks stellt einen kostenfreien
      Obfuskator zur Verf&uuml;gung, der diese Mindestanforderungen erf&uuml;llt.
    </p>
    <p> Eine yFiles Source Code Lizenz wird mit Erhalt des Kaufpreises g&uuml;ltig.
      <br/>
      Versp&auml;tet sich LZ mit f&auml;lligen Zahlungen um mehr als 10 Werktage,
      ist er auf Verlangen des Lizenzgebers zur vor&uuml;bergehenden L&ouml;schung
      der gelieferten Software und aller mit ihr erstellten Programme verpflichtet,
      ohne dass yWorks zuvor den R&uuml;cktritt vom Vertrag erkl&auml;ren
      muss.
    </p><p> <a name="yFilesByteCodeLicense"></a> </p>
  </li>
  <li><b>Byte Code Lizenz</b>
    <p> Eine Byte Code Lizenz r&auml;umt LZ das Recht ein, yFiles als Java Byte
      Code zu benutzen. Sie berechtigt LZ, Programme zu entwickeln, die yFiles
      benutzen. Sie erlaubt ferner, solche Programme zu benutzen, zu &uuml;bersetzen,
      zu modifizieren, abgeleitete Werke zu kreieren, und sie zu verkaufen. Es
      fallen f&uuml;r Nutzer dieser Programme keine Geb&uuml;hren an, und der
      Verkauf solcher Programme erzeugt keine Tantiemeverpflichtung.
    </p>
    <p> LZ ist nicht berechtigt, Dritten die Software ganz oder teilweise zu verkaufen,
      zu verleihen, zu vermieten, oder die Software auf andere Weise zu belasten
      oder zu &uuml;bertragen. Insbesondere ist LZ nicht berechtigt, die Software
      &uuml;ber den Teil des Codes hinaus, der Bestandteil des Programms ist,
      ganz oder teilweise zu vertreiben.
    </p>
    <p> LZ ist nicht berechtigt, die Software in einer Art und Weise zu umh&uuml;llen
      (&quot;wrapping&quot;), die es Dritten erm&ouml;glicht, die Funktionalit&auml;t
      der yFiles f&uuml;r Softwareentwicklung zu nutzen.
    </p>
    <p> LZ ist nur dann zur Auslieferung von yFiles innerhalb eigener Programm(teile)
      berechtigt, wenn die yFiles Klassen zuvor durch Anwendung eines Java Obfuskators
      gesch&uuml;tzt werden. Mindestanforderung an den Obfuskationsprozess
      ist, dass alle wesentlichen Klassen-, Methoden- und Feldnamen der zu
      yFiles geh&ouml;renden Klassen obfuskiert werden. Es soll damit nicht mehr
      m&ouml;glich sein, mit Hilfe der &ouml;ffentlich verf&uuml;gbaren yFiles
      API die Funktionalit&auml;t<br/>
      der yFiles zu nutzen.
    </p>
    <p>Die Obfuskation der yFiles kann mit jedem Obfuskator ausgef&uuml;hrt werden,
      der oben genannte Mindestanforderungen erf&uuml;llt. yWorks stellt einen kostenfreien
      Obfuskator zur Verf&uuml;gung, der diese Mindestanforderungen erf&uuml;llt.
    </p>
    <p>LZ ist nicht berechtigt, aus dem Java Byte Code Java Source Code zur&uuml;ckzuentwickeln.
        Es ist daher LZ untersagt den Java Byte Code zu disassemblieren,
        zu dekompilieren oder darauf andere Methoden des Reverse Engineering anzuwenden.
    </p>
    <p> Eine yFiles Byte Code Lizenz wird mit Erhalt des Kaufpreises g&uuml;ltig.
      <br/>
      Versp&auml;tet sich LZ mit f&auml;lligen Zahlungen um mehr als 10 Werktage,
      ist er auf Verlangen des Lizenzgebers zur vor&uuml;bergehenden L&ouml;schung
      der gelieferten Software und aller mit ihr erstellten Programme verpflichtet,
      ohne dass yWorks zuvor den R&uuml;cktritt vom Vertrag erkl&auml;ren
      muss.
    </p>
    <ol start="1" type="1">

      <li><a name="yFilesSiteLicense"></a> <b>Standortlizenz</b>
        <p> Eine Standortlizenz ist eine Byte Code Lizenz.
        </p>
        <p> Die Standortlizenz berechtigt LZ, die Software auf beliebig vielen
          Maschinen innerhalb des Unternehmensstandortes zu installieren und zu
          nutzen.
        </p><p> <a name="yFilesServerLicense"></a> </p>
      </li>
      <li><b>Serverlizenz</b>
        <p> Eine Serverlizenz ist eine Byte Code Lizenz.
        </p>
        <p> Die Serverlizenz berechtigt LZ, die Software auf einer einzelnen Maschine
          zu installieren und zu nutzen, die als Server dienen darf. Die Anzahl
          der Clients ist nicht beschr&auml;nkt.
        </p>
        <p> LZ ist nicht berechtigt, yFiles auf einer weiteren Maschine zu installieren
          oder auf eine weitere Maschine zu kopieren.
        </p><p> <a name="yFilesSingleUserLicense"></a> </p>
      </li>
      <li><b>Einzelplatzlizenz</b>
        <p> Eine Einzelplatzlizenz ist eine Byte Code Lizenz.
        </p>
        <p> Die Einzelplatzlizenz berechtigt LZ, die Software auf einer einzelnen
          Maschine zu installieren und zu nutzen, die nicht als Server dient.
        </p>
        <p> LZ ist nicht berechtigt, die Software auf einer weiteren Maschine
          zu installieren oder auf eine weitere Maschine zu kopieren.
        </p><p> <a name="yFilesEvaluationLicense"></a> </p>
      </li>
      <li><b>Evaluierungslizenz</b>
        <p> Eine Evaluierungslizenz ist eine Byte Code Lizenz.
        </p>
        <p> Eine yFiles Evaluierungslizenz erlaubt die Benutzung von yFiles f&uuml;r
          einen begrenzten Zeitraum. Wird in der Evaluierungsphase ein Produkt
          mit Hilfe von yFiles entwickelt, ist LZ verpflichtet, eine kommerzielle
          Lizenz zu erwerben.
        </p>
        <p> Eine Verl&auml;ngerung der Evaluierungsphase ist auf schriftliche
          Anfrage hin m&ouml;glich.
        </p>
        <p>Alle Kopien der Evaluierungsversion m&uuml;ssen vollst&auml;ndig gel&ouml;scht werden,
          nachdem der Evaluierungszeitraum abgelaufen ist.
        </p>
      </li>
    </ol>
    <p> <a name="yFilesAcademicLicense"></a> </p>
  </li>
  <li><b>Akademische Lizenz</b>
    <p> Die akademischen Lizenztypen entsprechen den kommerziellen Lizenztypen
      gem&auml;&szlig; B II.
    </p>
    <p>Eine akademische Lizenz beschr&auml;nkt den Einsatz der Software auf nicht-kommerzielle
      Zwecke (Forschung, Lehre, Projektarbeit, Kurse und Applikationsprogrammierung).
      <br/>
      LZ ist nicht berechtigt, Software, die mit Hilfe von yFiles unter einer
      akademischen Lizenz entwickelt wurde, ganz oder teilweise an Dritte zu &uuml;bertragen,
      wenn der Dritte eine kommerzielle Institution ist oder die Software kommerziell
      nutzt. Kommerzielle Institution ist hierbei definiert als Firma oder Organisation
      mit Gewinnstreben, kommerzielle Nutzung ist definiert als Nutzung innerhalb
      einer kommerziellen Institution, als Nutzung aufgrund Gewinnstrebens oder
      als Nutzung innerhalb einer Kooperation von zwei oder mehr Parteien, von
      denen mindestens eine entweder eine kommerzielle Institution ist oder Gewinnstreben
      besitzt.
     </p>
   </li>
 </ol>

<a name="PartC"></a>

<center><h1>- 3. Teil C -</h1></center>

<h2>Schlussbestimmungen</h2>
<ol start="1" type="I">
  <li><a name="Deliverables"></a><b>Auslieferung</b>
    <ol start="1" type="1">
      <li><p>yWorks versorgt LZ mit der elektronischen Dokumentation.
					</p>
      </li>
      <li><p>yWorks versorgt LZ mit der lizenzierten Software (Internet-Auslieferung).
					</p>
			</li>
    </ol>
  </li>
  <li><a name="Prices"></a><b>Preise</b>
		<p>Preise f&uuml;r die Software-Lizenzen gelten entsprechend den
			aktuellen Preislisten, die online erh&auml;ltlich sind.
		</p>
		<p><a name="IntellectualProperty"></a></p>
	</li>
	<li><b>Geistiges Eigentum</b>
		<p>yWorks sichert zu, dass sie nach Recht und Gesetz erm&auml;chtigt
		ist, LZ die Software entsprechend der hier enthaltenen
		Lizenzbedingungen zu lizenzieren. Weiter sichert yWorks zu,
		dass die hier enthaltenen Vereinbarungen nicht im Widerspruch
		zu anderen Vereinbarungen, durch die yWorks gebunden ist, stehen.
		yWorks sichert auch zu, dass die Software und Dokumentation, die
		an LZ nach den hier enthaltenen Bestimmungen ausgeliefert werden,
		nicht ein Patent, Urheberecht, oder sonstiges Recht eines Dritten
		verletzen, und yWorks sich keiner Umst&auml;nde bewusst ist, nach denen
		eine solche Verletzung eintreten k&ouml;nnte.
		</p>
	</li>
</ol>

</body>
</html>
