<html>
<head>
  <title>yWorks GmbH - Allgemeine Gesch&auml;ftsbedingungen</title>

  <link rel="stylesheet" type="text/css" href="doc/yfiles.css"/>

</head>
<body>

<h1>yWorks GmbH - Allgemeine Gesch&auml;ftsbedingungen</h1>

<center>Version 2.2 (14.06.2004)</center>

<h2>Inhalt</h2>

<h3><a href="#PartA">1. Teil A - Allgemeine Bestimmungen</a></h3>
<ol start="1" type="I">
  <li><a href="#ScopeA">Geltungsbereich</a> </li>
  <li><a href="#SupplyAndServices">Leistungsumfang</a></li> 
  <li><a href="#ObligationsAndLiabilitiesOfCustomer">Mitwirkungspflichten des 
    Auftraggebers</a> </li>
  <li><a href="#PerformanceOfOrder">Auftragsausf&uuml;hrung</a> </li>
  <li><a href="#Warranty">Gew&auml;hrleistung</a> </li>
  <li><a href="#LiabilityAndIndemnification">R&uuml;cktrittsrecht, Haftung und 
    Schadensersatz</a></li>
  <li><a href="#Nondisclosure">Geheimhaltung</a> </li>
  <li><a href="#Interference">Beeintr&auml;chtigung der Mitarbeiter</a> </li>
  <li><a href="#ForceMajeur">H&ouml;here Gewalt</a> </li>
  <li><a href="#ChargesAndPaymentTerms">Honorare, Nebenkosten, F&auml;lligkeiten</a></li> 
</ol>

<h3><a href="#PartB">2. Teil B - Wartung und Softwaresupport</a></h3>
<ol start="1" type="I">
  <li><a href="#ScopeB">Geltungsbereich</a></li>
  <li><a href="#Warranty">Wartung</a> </li>
  <li><a href="#Subscription">Subskription</a></li>
</ol>

<h3><a href="#PartC">3. Teil C - Schlussbestimmungen</a></h3>
<ol start="1" type="I">
  <li><a href="#Miscellaneous">Sonstiges</a></li>
</ol>

<a name="PartA"></a>

<center><h1>- 1. Teil A -</h1></center>

<h2>Allgemeine Bestimmungen</h2>

<ol start="1" type="I">
  <li><b>Geltungsbereich</b> 
	  <a name="ScopeA"></a> 
    <p><a name="ScopeA1"></a></p>
    <ol start="1" type="1">
      <li> 
        <p> Die Allgemeinen Gesch&auml;ftsbedingungen der yWorks GmbH, nachstehend 
          yWorks genannt, sind integrierter und wesentlicher Bestandteil jeder 
          Gesch&auml;ftsbeziehung zwischen der yWorks und ihrem Auftraggeber. 
          Von den nachfolgenden Regelungen abweichende Gesch&auml;ftsbedingungen 
          des Auftraggebers sind nicht bindend, soweit Unterschiede zu den vorliegenden 
          Bestimmungen und Regelungen bestehen. 
        </p>
        <p> <a name="ScopeA2"></a> </p>
      </li>
      <li> 
        <p> Die AGB und zugeh&ouml;rende Gesch&auml;ftsdokumente (wie Rechnungen, 
          Lizenzbedingungen und -urkunden) stellen die vollst&auml;ndige Vereinbarung 
          dar, und ersetzen alle vorher m&uuml;ndlich oder schriftlich getroffenen 
          Vereinbarungen zwischen yWorks und ihrem Auftraggeber. M&uuml;ndliche 
          und zus&auml;tzliche Vereinbarungen bed&uuml;rfen zu ihrer Wirksamkeit 
          der Schriftform, zumindest der schriftlichen Best&auml;tigung durch 
          yWorks.
         </p> 
        <p> <a name="ScopeA3"></a> </p>
      </li>
      <li> 
        <p> Der Vertragspartner erkennt durch die Erteilung eines Auftrages die 
          nachstehenden Bestimmungen an. 
        </p>
        <p></p>
      </li> 
    </ol>
    <a name="SupplyAndServices"></a> 
  </li>
  <li><b>Leistungsumfang</b> 
    <p class="pad"> Die Aufgabenstellung, die Vorgehensweise und die Art der zu 
      liefernden Arbeitsunterlagen und -ergebnisse werden in den schriftlichen 
      Vereinbarungen der Vertragsparteien geregelt. &Auml;nderungen, Erg&auml;nzungen 
      oder Erweiterungen der Aufgabenstellung, der Vorgehensweise und der Art 
      der Arbeitsunterlagen und -ergebnisse bed&uuml;rfen einer besonderen schriftlichen 
      Vereinbarung. 
    </p>
    <p> <a name="ObligationsAndLiabilitiesOfCustomer"></a> </p>
  </li>
  <li><b>Mitwirkungspflichten des Auftraggebers</b> 
    <p><a name="ObligationsAndLiabilitiesOfCustomer1"></a> </p>
    <ol start="1" type="1">
      <li> 
        <p> Der Auftraggeber verpflichtet sich, die zur Vertragserf&uuml;llung 
          erforderlichen T&auml;tigkeiten der yWorks zu unterst&uuml;tzen. Insbesondere 
          verschafft der Auftraggeber yWorks Zugang zu seiner Plattform, wenn 
          dies der yWorks f&uuml;r die Ausf&uuml;hrung der Auftragsverpflichtungen 
          notwendig erscheint. 
        </p>
        <p> <a name="ObligationsAndLiabilitiesOfCustomer2"></a> </p>
      </li>
      <li> 
        <p> Der Auftraggeber benennt eine Kontaktperson, die den Mitarbeitern 
          der yWorks w&auml;hrend der vereinbarten Arbeitszeit zur Verf&uuml;gung 
          steht; die Kontaktperson soll erm&auml;chtigt sein, Erkl&auml;rungen 
          abzugeben und die f&uuml;r die Auftragsausf&uuml;hrung relevanten Entscheidungen 
          zu treffen. 
        </p>
      </li>
    </ol>  
    <p> <a name="PerformanceOfOrder"></a> </p>
  </li>
  <li><b>Auftragsausf&uuml;hrung</b> 
    <p><a name="PerformanceOfOrder1"></a></p>
    <ol start="1" type="1">
      <li> 
        <p> Der Auftraggeber wird der yWorks bei der Bearbeitung des Auftrages 
          jede notwendige Unterst&uuml;tzung gew&auml;hren. Der Auftraggeber &uuml;bergibt 
          an die yWorks alle f&uuml;r die Durchf&uuml;hrung des Auftrages erforderlichen 
          Unterlagen, Daten, Datentr&auml;ger und Informationen unverz&uuml;glich 
          nach Anforderung oder gem&auml;&szlig; dem vereinbarten Terminplan. 
        </p>
        <p> <a name="PerformanceOfOrder2"></a></p>
      </li>
      <li> 
        <p> Der Auftraggeber tr&auml;gt die Verantwortung daf&uuml;r, dass 
          die von ihm &uuml;bergebenen Daten, Datentr&auml;ger und Programme richtig 
          und vollst&auml;ndig sind, und den gesetzlichen, steuerlichen und organisatorischen 
          Voraussetzungen und Bestimmungen entsprechen. </p>
      </li>
    </ol>
    <p> <a name="Warranty"></a></p>
  </li>
  <li><b>Gew&auml;hrleistung</b> 
    <ol start="1" type="1">
      <li>
        <a name="Warranty1"></a>  
        <p> yWorks gew&auml;hrleistet, dass die Software entsprechend den 
          Spezifikationen funktioniert. Sofern es sich nicht um unerhebliche M&auml;ngel 
          handelt, leistet yWorks f&uuml;r M&auml;ngel der Software, zu denen 
          auch das Fehlen ausdr&uuml;cklich zugesicherter oder garantierter Eigenschaften 
          geh&ouml;rt, Gew&auml;hr nach den folgenden Abs&auml;tzen. <br/>
          Alle weiteren Anspr&uuml;che f&uuml;r M&auml;ngel der Lieferung sind 
          ausgeschlossen. 
        </p> <p><a name="Warranty2"></a></p>
      </li>
      <li> 
        <p>Weist die Software der yWorks innerhalb von 12 Monaten nach Lieferung 
          nachweislich einen Mangel auf, leistet yWorks nach ihrer Wahl Nacherf&uuml;llung 
          durch Beseitigung des Mangels oder Gutschrift des Rechnungswertes. </p>
        <a name="Warranty3"></a> 
      </li>
      <li> 
        <p>M&auml;ngelr&uuml;gen innerhalb des vorstehend genannten Rahmens werden 
          nur anerkannt, wenn sie binnen zwei Wochen nach Empfang der Ware, bei 
          zun&auml;chst nicht erkennbaren M&auml;ngeln unverz&uuml;glich nach 
          Kenntniserlangung schriftlich in nachvollziehbarer Form gem&auml;&szlig; 
          Nr. 4 geltend gemacht werden.</p>
        <a name="Warranty4"></a> 
      </li>
      <li> 
        <p>Der Auftraggeber versorgt yWorks mit allen erforderlichen Daten, um 
          das Problem zu reproduzieren, sowie mit einer vollst&auml;ndigen Fehlerbeschreibung. 
          Ein Fehlerbericht ist au&szlig;erdem zusammen mit einem kurzen und vollst&auml;ndigen 
          Programm, das den Fehler zeigt, zu versehen. yWorks lehnt es ab, in 
          die Untersuchung einzusteigen, bevor nicht alle notwendigen Daten und 
          Unterlagen vorliegen. Vom Auftraggeber modifizierte fehlerhafte Programme 
          werden von der yWorks nicht untersucht.</p>
        <a name="Warranty5"></a> 
      </li>
      <li> 
        <p align="left">yWorks stellt Auftraggebern Bug Fix Releases und Patches kostenfrei 
          zur Verf&uuml;gung.</p>
        <a name="Warranty6"></a> 
      </li>
      <li> 
        <p>Die Gew&auml;hrleistung entf&auml;llt hinsichtlich solcher Programme 
          oder Programmteile, die vom Anwender nach Zurverf&uuml;gungstellung 
          durch die yWorks selbst ge&auml;ndert oder erweitert wurden, es sei 
          denn, der Anwender weist nach, dass solche &Auml;nderungen oder 
          Erweiterungen f&uuml;r den Mangel nicht urs&auml;chlich sind. 
        </p>
      </li>
    </ol>
   	<p> <a name="LiabilityAndIndemnification"></a></p>
  </li>
  <li><strong>R&uuml;cktrittsrecht, Haftung und Schadensersatz</strong> 
    <p><a name="LiabilityAndIndemnification1"></a></p>
    <ol start="1" type="1">
      <li>Der Auftraggeber kann vom Vertrag zur&uuml;cktreten, wenn die gesamte 
        Leistung der yWorks endg&uuml;ltig unm&ouml;glich wird. <br/>
        Soweit Teilleistungen m&ouml;glich und f&uuml;r den Auftraggeber auch 
        nach Beendigung des Vertrages im &Uuml;brigen verwertbar sind, beschr&auml;nkt 
        sich das R&uuml;cktrittsrecht auf die noch nicht geleisteten Teile. F&uuml;r 
        bereits erbrachte Teilleistungen besteht insoweit ein Verg&uuml;tungsanspruch.<br/>
        Entscheidet sich yWorks f&uuml;r Nacherf&uuml;llung durch Beseitigung 
        des Mangels, hat der Auftraggeber ein R&uuml;cktrittsrecht erst, wenn 
        die Beseitigung des Mangels zweimal fehlgeschlagen ist. <br/>
        Die Haftung der yWorks entf&auml;llt, sofern der Auftraggeber unsachgem&auml;&szlig;e 
        &Auml;nderungen oder Erweiterungen an Programmen oder Programmteilen vorgenommen 
        hat.
        <p> <a name="LiabilityAndIndemnification2"></a></p>
      </li>
      <li> 
        <p> Etwas anderes gilt nur f&uuml;r von yWorks, ihren Mitarbeitern oder 
          etwa von ihr eingeschalteten Dritten dem Auftraggeber vors&auml;tzlich 
          oder grob fahrl&auml;ssig zugef&uuml;gte, unmittelbare Sch&auml;den 
          - gleich aus welchem Rechtsgrund - einmalig bis zu einem Gesamtbetrag 
          in H&ouml;he der Gesamtverg&uuml;tung, h&ouml;chstens jedoch insgesamt 
          bis zu einem Betrag von EURO 25,000.00. Eine weitergehende Haftung ist 
          ausgeschlossen.
        </p><p> <a name="LiabilityAndIndemnification3"></a></p> 
      </li>
      <li> 
        <p> Die Haftung f&uuml;r Sch&auml;den aufgrund h&ouml;herer Gewalt ist 
          ebenfalls ausgeschlossen. </p>
        <p> <a name="LiabilityAndIndemnification4"></a></p>
      </li>
      <li> 
        <p> Die Haftung der yWorks richtet sich ausschlie&szlig;lich nach den 
          vorstehenden Regelungen. Alle dort nicht ausdr&uuml;cklich zugestandenen 
          Rechte, gleich aus welchem Rechtsgrund, sind ausgeschlossen. Etwas anderes 
          gilt nur, wenn nach dem jeweils anwendbaren Landesrecht eine Schadensersatzpflicht 
          besteht, die vertraglich nicht ausgeschlossen werden kann. 
        </p>
        <p></p> 
      </li>
      <li>
        <p><a name="LiabilityAndIndemnification5"></a> Der Auftraggeber nimmt zur 
        Kenntnis, dass yWorks' Software nicht f&uuml;r hochgradig risikobehaftete Bereiche 
        entwickelt und konzipiert wurde. Weder ist die Software zur &Uuml;berwachung 
        und Steuerung kerntechnischer Anlagen oder zu solcher des Flugverkehrs 
        geeignet, noch f&uuml;r Waffenanlagen, oder sonstige Apparaturen oder Anlagen, 
        bei denen eine Softwarest&ouml;rung zu Tod, Verletzung oder anderen ernsthaften 
        k&ouml;rperlichen oder umweltspezifischen Sch&auml;den f&uuml;hren kann. Jegliche Haftung 
        in diesem Bereich ist ausgeschlossen. 
        </p>
        <p></p>
      </li>
      <li> 
         <a name="LiabilityAndIndemnification6"></a> Schadensersatzanspr&uuml;che 
          Dritter gegen den Auftraggeber k&ouml;nnen nicht gegen die yWorks geltend 
          gemacht werden. 
       </li>
    </ol>
    <p> <a name="Nondisclosure"></a> </p>
  </li>
  <li><b>Geheimhaltung</b>  
    <ol start="1" type="1">
      <li> 
      <a name="Nondisclosure1"></a> 
      	<p> Derjenige, der die vertrauliche Information besitzt, wird im Folgenden 
          als EVI bezeichnet, derjenige, dem die vertrauliche Information offenbart 
          wird, als OVI. 
      	</p>
        <p> Der Begriff "vertrauliche Information" meint jegliche Informationen 
          und Materialien, die sich im Eigentum des EVI befinden, unabh&auml;ngig 
          davon, ob sie von EVI entwickelt wurden oder nicht, die anderen als 
          EVI nicht allgemein bekannt sind, und die OVI durch unmittelbaren oder 
          mittelbaren Kontakt zu EVI erlangen k&ouml;nnte. 
        </p>
        <p> Ohne Einschr&auml;nkung als vertrauliche Information gelten: </p>
        <ul>
          <li>Gesch&auml;ftsdokumente und Businesspl&auml;ne </li>
          <li>Gesch&auml;fts- und Betriebsgeheimnisse </li>
          <li>Technische Informationen </li>
          <li>Produkte </li>
          <li>Erfindungen </li>
          <li>Produkt-Design Informationen </li>
          <li>Benchmarktests </li>
          <li>Computerprogramme und Listings </li>
          <li>Source Code </li>
          <li>Dokumentationen </li>
        </ul>
        <p> und andere gesch&uuml;tzte Informationen. </p>
        <p> <a name="Nondisclosure2"></a></p>
      </li>
      <li> 
        <p> OVI ist sich bewusst und erkennt an, dass die vertrauliche 
          Information unter Einsatz von erheblicher Zeit, M&uuml;he und Ausgaben 
          entwickelt oder erlangt wurde, und dass die vertrauliche Information 
          ein wertvoller, besonderer und einzigartiger Aktivposten von EVI ist, 
          der EVI einen signifikanten Wettbewerbsvorteil verschafft, und deshalb 
          vor missbr&auml;uchlicher Bekanntmachung gesch&uuml;tzt werden 
          muss. 
        </p>
        <p> Beide Partner vereinbaren, dass sie f&uuml;r die Dauer des zwischen 
          ihnen bestehenden Vertrages sowie f&uuml;r einen Zeitraum von f&uuml;nf 
          Jahren nach dessen Ablauf jede vertrauliche Information des Vertragspartners 
          Dritten nicht zug&auml;nglich machen werden. 
        </p>
        <p> Als nicht vertraulich gelten Informationen, die bereits allgemein 
          bekannt oder zur Ver&ouml;ffentlichung bestimmt sind oder bereits vor 
          Ver&ouml;ffentlichung im Besitz von OVI waren und weder direkt noch 
          indirekt von EVI vor der Offenlegung zug&auml;nglich gemacht wurden 
          oder OVI von einem Dritten ohne Geheimhaltungsverpflichtung zug&auml;nglich 
          gemacht wurden oder unabh&auml;ngig von OVI, ohne diesen Vertrag zu 
          verletzen, entwickelt oder gewonnen wurden. 
        </p>
        <p> <a name="Nondisclosure3"></a> </p>
      </li>
      <li> 
        <p> Die vertrauliche Information darf ohne schriftliche Zustimmung von 
          EVI weder kopiert noch modifiziert werden. OVI darf die vertrauliche 
          Information weder verbreiten, vermieten, verleihen, kopieren, modifizieren, 
          &uuml;bersetzen, unterlizenzieren, &uuml;bertragen oder empfangen, insbesondere 
          auch nicht Software, Datentr&auml;ger und Dokumentationen. 
        </p>
        <p> <a name="Nondisclosure4"></a> </p>
      </li>
      <li> 
        <p> OVI soll die vertrauliche Information weder Angestellten noch Subunternehmern 
          offenbaren. Hiervon ausgenommen sind diejenigen Angestellten und Subunternehmer, 
          die zur Erf&uuml;llung ihrer Pflichten im Rahmen der Auftragserf&uuml;llung 
          notwendig Zugang zu der vertraulichen Information haben. 
        </p>
        <p> <a name="Nondisclosure5"></a> </p>
      </li>
      <li> 
        <p> Keine der Parteien hat durch diese Vereinbarung die Verpflichtung, 
          Services oder Produkte von der anderen Partei einzukaufen, oder Produkte, 
          die die vertrauliche Information enthalten weiterzuverkaufen. Diese 
          Vereinbarung erzeugt weder eine Allianz, noch eine Partnerschaft, noch 
          ein Joint Venture. 
        </p>
        <p> <a name="Nondisclosure6"></a> </p>
      </li>
      <li> 
        <p> OVI erlangt keinerlei Urheber- oder Eigentumsrechte &uuml;ber die 
          in dieser Vereinbarung und den zugeh&ouml;renden Gesch&auml;ftsdokumenten 
          einger&auml;umten Rechte hinaus. 
        </p>
        <p> OVI erkl&auml;rt, dass, so wie zwischen EVI und OVI, die vertrauliche 
          Information und alle zugeh&ouml;rigen Urheber- und Eigentumsrechte, 
          im Eigentum von EVI stehen und immer stehen werden, und dies auch dann, 
          wenn Kommentare, Vorschl&auml;ge und / oder Ideen von OVI in die vertrauliche 
          Information und zugeh&ouml;rende Dokumente und Materialien eingeflossen 
          sind.
        </p> 
      </li>
    </ol>
    <p> <a name="Interference"></a> </p>
  </li>
  <li><b>Beeintr&auml;chtigung der Mitarbeiter</b> 
    <p class="pad"> Der Auftraggeber verpflichtet sich, die Unabh&auml;ngigkeit 
      der Mitarbeiter der yWorks nicht zu beeintr&auml;chtigen. Das hei&szlig;t 
      insbesondere, dass der Auftraggeber es unterl&auml;sst, Mitarbeitern 
      der yWorks Angebote auf Anstellung oder Angebote auf Durchf&uuml;hrung der 
      Aufgaben auf eigene Rechnung zu unterbreiten. 
    </p>
    <p> <a name="ForceMajeur"></a> </p>
  </li>
  <li><b>H&ouml;here Gewalt</b> 
    <p class="pad"> Ereignisse h&ouml;herer Gewalt, die der yWorks die Leistung 
      wesentlich erschweren oder unm&ouml;glich machen, berechtigen sie, die Erf&uuml;llung 
      ihrer Verpflichtungen um die Dauer der Behinderung und um eine angemessene 
      Anlaufzeit hinauszuschieben oder diese ganz abzubrechen. Der h&ouml;heren 
      Gewalt stehen Streik, Aussperrung und &auml;hnliche Umst&auml;nde, von denen 
      die yWorks mittelbar oder unmittelbar betroffen ist, gleich. 
    </p>
    <p> <a name="ChargesAndPaymentTerms"></a></p>
  </li>
  <li><b>Honorare, Nebenkosten, F&auml;lligkeiten</b> 
    <ol start="1" type="1">
      <li> 
        <a name="ChargesAndPaymentTerms1"></a> 
      	<p> Rechnungen werden entsprechend den g&uuml;ltigen Preisverzeichnissen, 
          die online erh&auml;ltlich sind, gestellt. yWorks ist berechtigt, die 
          Preise nach ihrem Belieben zu ver&auml;ndern. Solche &Auml;nderungen 
          gelten nicht r&uuml;ckwirkend. 
        </p>
        <p> <a name="ChargesAndPaymentTerms2"></a> </p>
      </li>
      <li> 
        <p> Rechnungen sind mit Rechnungserhalt und ohne Abzug f&auml;llig. Der 
          Rechnungsbetrag ist entsprechend den Bestimmungen der Rechnung oder 
          zugeh&ouml;render Gesch&auml;ftsdokumente zu begleichen. Der Auftraggeber 
          verpflichtet sich, seinen Zahlungsobliegenheiten inkl. evtl. anfallender 
          Verzugszinsen ordnungsgem&auml;&szlig; nachzukommen. yWorks stellt dem 
          Auftraggeber alle durch einen Zahlungsverzug entstehenden Kosten einschlie&szlig;lich 
          m&ouml;glicher Anwaltsgeb&uuml;hren sowie Gerichts- und Verwaltungskosten 
          in Rechnung. 
        </p>
        <p> <a name="ChargesAndPaymentTerms3"></a> </p>
      </li>
      <li> 
        <p> Anfallende Zollgeb&uuml;hren und Versandkosten gehen zu Lasten des 
          Auftraggebers. 
        </p>
      </li>    
    </ol>
  </li>
</ol>


<a name="PartB"></a>

<center><h1>- 2. Teil B -</h1></center>
<h2>Wartung und Softwaresupport</h2>

<ol start="1" type="I">
  <li><b>Geltungsbereich</b> 
    <a name="ScopeB"></a> 
  	<ol start="1" type="1">
      <li> 
        <a name="ScopeB1"></a> 
      	<p> Die Bestimmungen des 2. Teil B der hier vorliegenden AGB beziehen 
          sich auf Wartung und Support der Softwareprodukte von yWorks. 
        </p>
        <p> <a name="ScopeB2"></a> </p>
      </li>
      <li> 
        <p> M&uuml;ndliche und zus&auml;tzliche Vereinbarungen hinsichtlich Softwaresupport 
          und Wartung bed&uuml;rfen zu ihrer Wirksamkeit der Schriftform, zumindest 
          der schriftlichen Best&auml;tigung durch yWorks. 
        </p>
      </li>
    </ol>
    <p> <a name="Warranty"></a> </p>
  </li>
  <li><b>Wartung</b> 
    <p> Jegliche Wartung der Software, die die Gew&auml;hrleistung gem&auml;&szlig; 
      A V &uuml;bersteigt, ist in einem gesonderten Supportvertrag zu vereinbaren, 
      der entweder den Bestimmungen und Regeln von B III folgt. 
    </p>
    <p> <a name="Subscription"></a> </p>
  </li>
  <li><b>Subskription</b> 
    <ol start="1" type="1">
      <li> 
        <a name="Subscription1"></a> 
      	<p> Zusammen mit der Lizenz kann auch eine Subskription eingegangen werden.<br/>
          Eine Subskription enth&auml;lt die folgenden Leistungen: 
        </p>
        <ul>
          <li> Alle Versionen und Upgrades der lizenzierten Software, die innerhalb 
            der Laufzeit erscheinen. </li>
          <li> Technischen Standard Support im Sinne der B III 4 - B III 7. </li>
          <li> Das Recht, die Subskription nach Ablauf um ein Jahr zu verl&auml;ngern. </li>
        </ul>
        <p>
       	Der Auftraggeber ist nicht berechtigt, die Subskription sp&auml;ter als 
        die zugeh&ouml;rende Lizenz einzukaufen. Das Subskriptionspaket enth&auml;lt 
        die gew&uuml;nschte Lizenz und die Subskriptionsleistungen. 
        </p>
        <p> <a name="Subscription2"></a> </p>
      </li>
      <li> 
        <p> Die Subskription tritt mit Rechnungsdatum der korrespondierenden Lizenz 
          in kraft. Die Laufzeit der Subskription betr&auml;gt zw&ouml;lf (12) 
          Monate von Inkrafttreten an, sofern die Subskriptionsvereinbarung nicht 
          verl&auml;ngert wird. 
        </p>
        <p> Der Auftraggeber ist berechtigt, aber nicht verpflichtet, die Subskriptionsvereinbarung 
          nach Ablauf zu verl&auml;ngern. 
        </p>
        <p> <a name="Subscription3"></a></p>
      </li>
      <li> 
        <p> Der Preis f&uuml;r die Subskription gilt entsprechend der aktuellen 
          Preislisten, die online erh&auml;ltlich sind. 
        </p>
        <p> <a name="Subscription4"></a> </p>
      </li>
      <li> 
        <p> Unterst&uuml;tzt wird jeweils die letzte Version eines Programms oder Programmpaketes, 
          das vom Auftraggeber lizenziert ist. &Auml;ltere Versionen von Programmen 
          werden l&auml;ngstens f&uuml;r einen Zeitraum von einem Monat ab Verf&uuml;gbarkeit 
          der jeweils neuesten Programmversion unterst&uuml;tzt. 
        </p>
        <p> <a name="Subscription5"></a> </p>
      </li>
      <li> 
        <p> Der Auftraggeber ist alleine verantwortlich f&uuml;r Kontakt zu seinen 
          Kunden, die Programme benutzen, welche auf Software von yWorks aufbauen. 
        </p>
        <p> <a name="Subscription6"></a> </p>
      </li>
      <li> 
        <p> yWorks legt schriftlich eine zust&auml;ndige Kontaktperson fest. Eine 
          &Auml;nderung des Kontakts erfolgt durch schriftliche Mitteilung. 
        </p>
        <p> yWorks unterh&auml;lt eine E-Mail Adresse und Faxnummer, &uuml;ber 
          die yWorks bei auftretenden Fehlern und Problemen zu erreichen ist. 
        </p>
        <p> yWorks h&auml;lt f&uuml;r die Durchf&uuml;hrung von zeitnaher und 
          fachkundiger Unterst&uuml;tzung Fachpersonal bereit. 
        </p>
        <p> yWorks versorgt den Auftraggeber mit technischer Unterst&uuml;tzung f&uuml;r 
          die Software. 
        </p>
        <p> yWorks benachrichtigt und unterst&uuml;tzt den Auftraggeber im Falle, 
          dass yWorks einen Softwarefehler entdeckt. 
        </p>
        <p> yWorks versorgt den Auftraggeber mit Instruktionen f&uuml;r die Implementierung, 
          soweit diese nicht kreative intellektuelle Prozesse erfordern. 
        </p>
        <p> yWorks &uuml;bergibt dem Auftraggeber Bug Fixes und Fehlerumgehungen 
          im Falle von Softwarefehlern. 
        </p>
        <p> yWorks versorgt den Auftraggeber mit allen Upgrades der Software. 
        </p>
        <p> yWorks verpflichtet sich, gegen angemessene Verg&uuml;tung spezielle 
          Entwicklungsauftr&auml;ge anzunehmen, die mit der lizenzierten Software 
          zusammenh&auml;ngen. Der Auftraggeber ist berechtigt, aber nicht verpflichtet, 
          yWorks derartige Auftr&auml;ge zu erteilen. 
        </p>
        <p> yWorks ist berechtigt, Subunternehmer mit der Durchf&uuml;hrung der 
          Arbeiten zu beauftragen. 
        </p>
        <p> <a name="Subscription7"></a> </p>
      </li>
      <li> 
        <p> Der Auftraggeber legt schriftlich eine zust&auml;ndige Kontaktperson 
          fest. Eine &Auml;nderung des Kontakts erfolgt durch schriftliche Mitteilung. 
        </p>
        <p> Der Auftraggeber stellt sicher, dass w&auml;hrend der Vertragslaufzeit 
          fachkundiges, in der Bedienung des Systems und der Programme geschultes 
          Personal zur Verf&uuml;gung steht. 
        </p>
        <p> Im Falle von Softwarefehlern versorgt der Auftraggeber yWorks mit 
          allen erforderlichen Daten, um das Problem zu reproduzieren, sowie mit 
          einer vollst&auml;ndigen Fehlerbeschreibung. Ein Fehlerbericht ist au&szlig;erdem 
          zusammen mit einem kurzen und vollst&auml;ndigen Programm, das den Fehler 
          zeigt, zu versehen. yWorks lehnt es ab, in die Untersuchung einzusteigen, 
          bevor nicht alle notwendigen Daten und Unterlagen vorliegen. 
        </p>
        <p> Der Auftraggeber verschafft yWorks Zugang zu seiner Plattform, wenn 
          dies f&uuml;r die Realisierung der Supportverpflichtungen unerl&auml;sslich 
          ist. 
        </p>
        <p> Der Auftraggeber ist verpflichtet, die zur Erf&uuml;llung der Supportbem&uuml;hungen 
          erforderlichen T&auml;tigkeiten der yWorks zu unterst&uuml;tzen, soweit 
          eine solche Unterst&uuml;tzung zur Erf&uuml;llung der Verpflichtungen 
          unerl&auml;sslich ist. 
        </p>
       </li>
    </ol>
	</li>
</ol>

<a name="PartC"></a>

<center><h1>- 3. Teil C -</h1></center>

<h2>Schlussbestimmungen</h2>

<ol start="1" type="I">
  <li><b>Sonstiges</b>
  	<a name="Miscellaneous"></a>
    <ol start="1" type="1">
      <li><a name="Miscellaneous1"></a>
      	<p>yWorks ist berechtigt, diese Allgemeinen Gesch&auml;ftsbedingungen jederzeit
				nach eigenem Ermessen zu &uuml;berarbeiten und zu &auml;ndern. Hinweise auf 
				&Auml;nderungen erfolgen durch Aufnahme der &Auml;nderungen in den Vertragstext 
				unter <a href="http://www.yworks.com/ger/company_legal_businesstermsandconditions.htm" target="_top">http://www.yworks.com/ger/company_legal_businesstermsandconditions.htm</a>.
				</p>
				<p>
				Es liegt in der Verantwortung des Auftraggebers, diese Website 
				aufzusuchen und sich mit der aktuellen Version bekannt zu machen. 
				yWorks ist berechtigt, den Auftraggeber auch auf anderem Wege &uuml;ber 
				&Auml;nderungen zu informieren. &Auml;nderungen sind nicht r&uuml;ckwirkend.
				</p>
				<p></p>
      </li>
      <li><a name="Miscellaneous2"></a>
				<p>Es ist ausschlie&szlig;lich das Recht der Bundesrepublik Deutschland 
				anzuwenden. Sind Vorschriften dieser AGB unwirksam, werden die 
				&uuml;brigen Bestimmungen hierdurch nicht ber&uuml;hrt. Die Parteien 
				verpflichten sich, die unwirksamen Vorschriften unverz&uuml;glich 
				durch wirtschaftlich und rechtlich m&ouml;glichst gleichwertige zu 
				ersetzen.
				</p>
				<p><a name="Miscellaneous3"></a></p>
      </li>
      <li>
				<p>yWorks ist berechtigt, seine Auftraggeber als Referenzkunden 
				zu benennen. 
				</p>
				<p><a name="Miscellaneous4"></a></p>
     	</li>
      <li>
				<p>&Auml;nderungen und Erg&auml;nzungen des Vertrages bed&uuml;rfen der Schriftform 
				und m&uuml;ssen als solche ausdr&uuml;cklich gekennzeichnet sein. Der 
				Auftraggeber ist ohne vorhergehende schriftliche Einwilligung der 
				yWorks nicht berechtigt, Rechte aus der Gesch&auml;ftsbeziehung mit 
				yWorks auf Dritte zu &uuml;bertragen.
				</p>
				<p><a name="Miscellaneous5"></a></p>
      </li>
      <li>
				<p>Gerichtsstand ist der Gesch&auml;ftssitz der yWorks, T&uuml;bingen. 
				yWorks beh&auml;lt sich vor, gerichtliche Schritte gegen den 
				Auftraggeber auch am allgemeinen Gerichtsstand des Auftraggebers 
				einzuleiten.
				</p>
			</li>
  </ol>
  </li>
</ol>

</body>
</html>